package com.example.testDB;

import com.example.Dao.Dao;
import com.example.model.Apartments;

public class TestDateBase {
    public static void createApartments(Dao apartDao){
        apartDao.create(new Apartments("Одеса,вул.Південно-Кільцева",3,100,12159,"Здам двох кімнатну квартиру по вул.Південно-Кільцева (р-н Комарова)." +
                "Всі меблі та побутова техніка."));
        apartDao.create(new Apartments("Київ,проспект Любомира Гузара 13",2,65,22000,"Комплекс з закритою територію, є місця для паковки, є підвал - сховище (у власника є кладова). " +
                "Комплекс високого рівня, поверх 15-16, загальна площа 65м2. " +
                "Дві окремі кімнати, окремо кухня, двоспальне ліжко, односпальне повноцінне ліжко, посудомийка, два кондиціонери, плазма. Дві шафи."));
        apartDao.create(new Apartments("Вінниця, вул. Волонтерська, 70А",1,32,5000,". Квартира у чудовому стані. Є необхідні меблі та техніка: " +
                "пральна машина, диван, мікрохвильова піч, великий холодильник, духовка, кондиціонер."));
    }
}
